In [4]:
import pandas as pd
import numpy as np

# Intro to the Working with Text Data Section

In [7]:
chicago = pd.read_csv("chicago.csv")
chicago.head(3)

Help on function sort in module numpy:

sort(a, axis=-1, kind=None, order=None)
    Return a sorted copy of an array.

    Parameters
    ----------
    a : array_like
        Array to be sorted.
    axis : int or None, optional
        Axis along which to sort. If None, the array is flattened before
        sorting. The default is -1, which sorts along the last axis.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, optional
        Sorting algorithm. The default is 'quicksort'. Note that both 'stable'
        and 'mergesort' use timsort or radix sort under the covers and, in general,
        the actual implementation will vary with data type. The 'mergesort' option
        is retained for backwards compatibility.

        .. versionchanged:: 1.15.0.
           The 'stable' option was added.

    order : str or list of str, optional
        When `a` is an array with fields defined, this argument specifies
        which fields to compare first, second, etc.  A single field can
        be specified as a string, and not all fields need be specified,
        but unspecified fields will still be used, in the order in which
        they come up in the dtype, to break ties.

    Returns
    -------
    sorted_array : ndarray
        Array of the same type and shape as `a`.

    See Also
    --------
    ndarray.sort : Method to sort an array in-place.
    argsort : Indirect sort.
    lexsort : Indirect stable sort on multiple keys.
    searchsorted : Find elements in a sorted array.
    partition : Partial sort.

    Notes
    -----
    The various sorting algorithms are characterized by their average speed,
    worst case performance, work space size, and whether they are stable. A
    stable sort keeps items with the same key in the same relative
    order. The four algorithms implemented in NumPy have the following
    properties:

    =========== ======= ============= ============ ========
       kind      speed   worst case    work space   stable
    =========== ======= ============= ============ ========
    'quicksort'    1     O(n^2)            0          no
    'heapsort'     3     O(n*log(n))       0          no
    'mergesort'    2     O(n*log(n))      ~n/2        yes
    'timsort'      2     O(n*log(n))      ~n/2        yes
    =========== ======= ============= ============ ========

    .. note:: The datatype determines which of 'mergesort' or 'timsort'
       is actually used, even if 'mergesort' is specified. User selection
       at a finer scale is not currently available.

    All the sort algorithms make temporary copies of the data when
    sorting along any but the last axis.  Consequently, sorting along
    the last axis is faster and uses less space than sorting along
    any other axis.

    The sort order for complex numbers is lexicographic. If both the real
    and imaginary parts are non-nan then the order is determined by the
    real parts except when they are equal, in which case the order is
    determined by the imaginary parts.

    Previous to numpy 1.4.0 sorting real and complex arrays containing nan
    values led to undefined behaviour. In numpy versions >= 1.4.0 nan
    values are sorted to the end. The extended sort order is:

      * Real: [R, nan]
      * Complex: [R + Rj, R + nanj, nan + Rj, nan + nanj]

    where R is a non-nan real value. Complex values with the same nan
    placements are sorted according to the non-nan part if it exists.
    Non-nan values are sorted as before.

    .. versionadded:: 1.12.0

    quicksort has been changed to `introsort <https://en.wikipedia.org/wiki/Introsort>`_.
    When sorting does not make enough progress it switches to
    `heapsort <https://en.wikipedia.org/wiki/Heapsort>`_.
    This implementation makes quicksort O(n*log(n)) in the worst case.

    'stable' automatically chooses the best stable sorting algorithm
    for the data type being sorted.
    It, along with 'mergesort' is currently mapped to
    `timsort <https://en.wikipedia.org/wiki/Timsort>`_
    or `radix sort <https://en.wikipedia.org/wiki/Radix_sort>`_
    depending on the data type.
    API forward compatibility currently limits the
    ability to select the implementation and it is hardwired for the different
    data types.

    .. versionadded:: 1.17.0

    Timsort is added for better performance on already or nearly
    sorted data. On random data timsort is almost identical to
    mergesort. It is now used for stable sort while quicksort is still the
    default sort if none is chosen. For timsort details, refer to
    `CPython listsort.txt <https://github.com/python/cpython/blob/3.7/Objects/listsort.txt>`_.
    'mergesort' and 'stable' are mapped to radix sort for integer data types. Radix sort is an
    O(n) sort instead of O(n log n).

    .. versionchanged:: 1.17.0

    NaT now sorts to the end of arrays for consistency with NaN.

    Examples
    --------
    >>> a = np.array([[1,4],[3,1]])
    >>> np.sort(a)                # sort along the last axis
    array([[1, 4],
           [1, 3]])
    >>> np.sort(a, axis=None)     # sort the flattened array
    array([1, 1, 3, 4])
    >>> np.sort(a, axis=0)        # sort along the first axis
    array([[1, 1],
           [3, 4]])

    Use the `order` keyword to specify a field to use when sorting a
    structured array:

    >>> dtype = [('name', 'S10'), ('height', float), ('age', int)]
    >>> values = [('Arthur', 1.8, 41), ('Lancelot', 1.9, 38),
    ...           ('Galahad', 1.7, 38)]
    >>> a = np.array(values, dtype=dtype)       # create a structured array
    >>> np.sort(a, order='height')                        # doctest: +SKIP
    array([('Galahad', 1.7, 38), ('Arthur', 1.8, 41),
           ('Lancelot', 1.8999999999999999, 38)],
          dtype=[('name', '|S10'), ('height', '<f8'), ('age', '<i4')])

    Sort by age, then height if ages are equal:

    >>> np.sort(a, order=['age', 'height'])               # doctest: +SKIP
    array([('Galahad', 1.7, 38), ('Lancelot', 1.8999999999999999, 38),
           ('Arthur', 1.8, 41)],
          dtype=[('name', '|S10'), ('height', '<f8'), ('age', '<i4')])

In [8]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [10]:
chicago["Department"].nunique()   # We want to modify the DEPARTMENT from object (str) 
                                  # to a catagory. there are only 35 unique departments

35

In [14]:
chicago["Department"] = chicago["Department"].astype("category")

In [15]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

In [18]:
chicago.dropna(how = 'all', inplace = True)
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

# Common String Methods - lower, upper, title, and len

In [19]:
chicago = pd.read_csv("chicago.csv")
chicago["Department"] = chicago["Department"].astype("category") 
# chicago.dropna(how = 'all', inplace = True)

In [22]:
chicago["Name"].str.lower().str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [28]:
chicago["Name"] = chicago["Name"].str.title()
chicago["Department"] = chicago["Department"].str.title()
chicago["Position Title"] = chicago["Position Title"].str.title()
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32058,"Zygowicz, Peter J",Police Officer,Police,$87384.00
32059,"Zymantas, Mark E",Police Officer,Police,$84450.00
32060,"Zyrkowski, Carlo E",Police Officer,Police,$87384.00
32061,"Zyskowski, Dariusz",Chief Data Base Analyst,Doit,$113664.00
32062,NaN,NaN,NaN,NaN

# Use the str.replace method to replace all occurrences of character with another

In [41]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [36]:
# IN the df at department columnt, there is a value with the abbrivation of MGMNT
# We would like to replace that to MANAGEMENT
chicago["Department"] = chicago["Department"].str.replace("MGMNT", "MANAGEMENT")
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00

In [42]:
# Here we will remove the dollar ($) sign, and also change the "Employee Annual Salary" to float
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.head(3)

                Name    Position Title   Department  Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT                 90744.0
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE                 84450.0
2     AARON,  KARINA    POLICE OFFICER       POLICE                 84450.0

In [43]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  float64
dtypes: category(1), float64(1), object(2)
memory usage: 1.0+ MB

# Filter a DataFrame's Rows with String Methods

In [44]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [49]:
# Because Python is case sensitive, and we want to filter, for example the word "WATER" from
# "Position Title" column, we need to transfer the data from this column, to a lowercase 
# and then use the *contains* method where we will search for the word "water"
water_in_position_title = chicago["Position Title"].str.lower().str.contains("water")
chicago[water_in_position_title].head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,90744.0
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,102440.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,82044.0
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MGMNT,109272.0
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,102440.0

In [53]:
# In the next code we will learn about startswith:
chicago[chicago["Position Title"].str.lower().str.startswith("water")].head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,90744.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,82044.0
1054,"ASHLEY, KARMA T",WATER CHEMIST II,WATER MGMNT,82044.0
1079,"ATKINS, JOANNA M",WATER CHEMIST II,WATER MGMNT,82044.0
1181,"AZEEM, MOHAMMED A",WATER CHEMIST II,WATER MGMNT,53172.0

In [54]:
# In the next code we will learn about endswith:
chicago[chicago["Position Title"].str.lower().str.endswith("ist")].head()

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,99840.0
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,81948.0
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,89880.0
472,"ALLEN, ROBERT",MACHINIST,WATER MGMNT,94328.0
705,"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,91476.0

# More DataFrame String Methods - strip, lstrip, and rstrip

In [55]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [56]:
"        Hello World          ".lstrip()  #l mean left

'Hello World          '

In [57]:
"        Hello World          ".rstrip()   #r mean right

'        Hello World'

In [58]:
"        Hello World          ".strip()   #erase all the additional white-spaces

'Hello World'

In [65]:
chicago["Name"].str.lstrip().head()

0        AARON,  ELVIA J
1      AARON,  JEFFERY M
2         AARON,  KARINA
3    AARON,  KIMBERLEI R
4    ABAD JR,  VICENTE M
Name: Name, dtype: object

# Invoke String Methods on DataFrame Index and Columns

In [66]:
chicago = pd.read_csv("chicago.csv", index_col = "Name").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.tail()

,Position Title,Department,Employee Annual Salary
Name,,,
"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [77]:
chicago.index = chicago.index.str.strip().str.title()  # The index returns the values as in a LIST,
                                       # strip - erase whitespaces, title capitilaze the 1st char.
chicago.head(3)

                     Position Title   Department  Employee Annual Salary
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT                 90744.0
Aaron,  Jeffery M    POLICE OFFICER       POLICE                 84450.0
Aaron,  Karina       POLICE OFFICER       POLICE                 84450.0

In [78]:
# In that part of code, we will captiliaze the coulmns label.
chicago.columns = chicago.columns.str.upper()
chicago.head(3)

                     POSITION TITLE   DEPARTMENT  EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT                 90744.0
Aaron,  Jeffery M    POLICE OFFICER       POLICE                 84450.0
Aaron,  Karina       POLICE OFFICER       POLICE                 84450.0

# Split Strings by Characters with the str.split Method

In [79]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [82]:
"Hello my name is idan".split(" ")  # take a single element, and brings back a LIST of all the separate arguments.

['Hello', 'my', 'name', 'is', 'idan']

In [84]:
chicago["Name"].str.split(",").str.get(0)   # We define that the "," will split and make a list in each row that
                                            # seperate the last name from the first name. 
                                            #the "get" method will ask for an index argument. we want the last name 
                                            # in index position of zero (0)

0            AARON
1            AARON
2            AARON
3            AARON
4          ABAD JR
           ...
32057      ZYGADLO
32058     ZYGOWICZ
32059     ZYMANTAS
32060    ZYRKOWSKI
32061    ZYSKOWSKI
Name: Name, Length: 32062, dtype: object

In [85]:
# if we want to count how many pepole have the same last name, we will use value_counts() method
chicago["Name"].str.split(",").str.get(0).value_counts()

WILLIAMS       293
JOHNSON        244
SMITH          241
BROWN          185
JONES          183
              ...
GANGAVARAPU      1
BARDSLEY JR      1
PUJOE            1
DE CESARE        1
CACCIATORE       1
Name: Name, Length: 13830, dtype: int64

In [88]:
# At this scenario, we let python count how many firsts word (Index = 0) in column "Position Title".
# very important note: we use the "get" method because if we invoke it, there will be a bunch of lists, and not words
# when we use the "get", we dividing these list into a word in the index position.
chicago["Position Title"].str.split(" ").str.get(0).value_counts()

POLICE                 10856
FIREFIGHTER-EMT         1509
SERGEANT                1186
POOL                     918
FIREFIGHTER              810
                       ...
VETERINARIAN-HOURLY        1
CURATOR                    1
CORPORATION                1
OFFSET                     1
VOLUNTEER                  1
Name: Position Title, Length: 320, dtype: int64

# More Practice with the str.split method on a Series

In [89]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [98]:
chicago["Name"].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts()
#The line above is very complax. first, we took "Name" column and split it with index #1 (First name),
#In this scanario, there are a lot of blank spaces, so we use the strip method to erase them.
#After that we use again the split method, but now we use erase all the bkank space and get the newly #0 index (Still 
# first name). Then we used value_counts method to look what are the commonly first names.

MICHAEL      1153
JOHN          899
JAMES         676
ROBERT        622
JOSEPH        537
             ...
CAROLYNN        1
IVETTE          1
GLORIANE        1
FRANCENIA       1
WAGNER          1
Name: Name, Length: 5091, dtype: int64

# Exploring the expand and n Parameters of the str.split Method

In [ ]:
# In this lesson we will learn 2 additional parameters that are available on our strings split method.

In [99]:
chicago = pd.read_csv("chicago.csv").dropna(how = 'all')  #dropping all the rows with null
chicago["Department"] = chicago["Department"].astype("category") 
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype(float)
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528.0
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,87384.0
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,84450.0
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,87384.0
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,113664.0

In [101]:
chicago["Name"].str.split(",", expand =True).head(2)   # Here we got 2 columns, that we can extract them into a new
                                                       # column in our database.

       0            1
0  AARON      ELVIA J
1  AARON    JEFFERY M

In [103]:
chicago[["Last Name", "First Name"]] = chicago["Name"].str.split(",", expand =True)

In [104]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,Last Name,First Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,90744.0,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0,AARON,KARINA

In [108]:
# In another case, the "Position Title" have more then 2 words
chicago["Position Title"].str.split(" ", expand= True).head(6)

        0         1          2         3     4     5     6     7     8
0   WATER      RATE      TAKER      None  None  None  None  None  None
1  POLICE   OFFICER       None      None  None  None  None  None  None
2  POLICE   OFFICER       None      None  None  None  None  None  None
3   CHIEF  CONTRACT  EXPEDITER      None  None  None  None  None  None
4   CIVIL  ENGINEER         IV      None  None  None  None  None  None
5    ASST        TO        THE  ALDERMAN  None  None  None  None  None

In [112]:
# In that situation we can use another argument in the split method, and its the n argument.
# With the n argument we can define how many rows to expand for the spliting.
chicago["Position Title"].str.split(" ", expand= True, n= 3).head(9)

         0         1            2             3
0    WATER      RATE        TAKER          None
1   POLICE   OFFICER         None          None
2   POLICE   OFFICER         None          None
3    CHIEF  CONTRACT    EXPEDITER          None
4    CIVIL  ENGINEER           IV          None
5     ASST        TO          THE      ALDERMAN
6  GENERAL   LABORER            -           DSS
7  TRAFFIC   CONTROL  AIDE-HOURLY          None
8    STAFF      ASST           TO  THE ALDERMAN